var missionsInfo = [
	{
		"id": 0
		, "filename": "CO16-Wastelands-1B.ProvingGrounds_PMC"
		, "title": "CO16 Wastelands (1B)"
		, "player_count": 16
		, "terrain": "ProvingGrounds_PMC"
		, "tags": ["SPECOPS"]
		, "overview": "Takistan Army patrols wastelands Takistan Army patrols wastelands Takistan Army patrols wastelands Takistan Army patrols wastelands"
		, "briefing": "14 марта 2012 года. Республика Такистан.<br /><br />Активность инсургентов резко возросла за последние месяцы, после открытых заявлений правительства США о введении санкций против Такистана.<br /><br />В связи с этим армия возобновляет патрулирования удаленных районов страны, чтобы пресечь попытки поставок оружия и наемников из пограничных областей"
			+ "<br /><br />А. Враждебные силы:<br />Маловероятно - инсургенты (племена роялистов), численностью до взвода."
			+ "<br /><br />Б. Дружественные силы:<br />2х моторизированные отделения Армии Такистана" 
			+ "<br/><br/>II. Задание:<br/>- Пройти по контрольным точкам КТ 1, КТ 2, КТ 3.<br />- В случае обнаружения инсургентов - сообщить штабу, при возможности - уничтожить."
			+ "<br/><br/>IV. Поддержка:<br />2х Land Rover (M2HB)<br />2x Land Rover" 
		, "map_shot": "https://img.rule34.xxx//images/3123/9f6b32d7f01af8a3558cfaed8ff96e4f.jpeg?3506572" 
	}
	, {
		"id": 1
		, "filename": "CO16-SubWastelands-1B.ProvingGrounds_PMC"
		, "title": "CO16 SubWastelands (1B)"
		, "player_count": 11
		, "terrain": "ProvingGrounds_PMC"
		, "tags": []
		, "overview": "Takistan Army patrols wastelands"
		, "briefing": "14 марта 2012 года. Республика Такистан.<br /><br />Активность инсургентов резко возросла за последние месяцы, после открытых заявлений правительства США о введении санкций против Такистана.<br /><br />В связи с этим армия возобновляет патрулирования удаленных районов страны, чтобы пресечь попытки поставок оружия и наемников из пограничных областей"
			+ "<br /><br />А. Враждебные силы:<br />Маловероятно - инсургенты (племена роялистов), численностью до взвода."
			+ "<br /><br />Б. Дружественные силы:<br />2х моторизированные отделения Армии Такистана" 
			+ "<br/><br/>II. Задание:<br/>- Пройти по контрольным точкам КТ 1, КТ 2, КТ 3.<br />- В случае обнаружения инсургентов - сообщить штабу, при возможности - уничтожить."
			+ "<br/><br/>IV. Поддержка:<br />2х Land Rover (M2HB)<br />2x Land Rover" 
		, "map_shot": "https://img.rule34.xxx//images/3039/ea35cb8da7bd046860610221c7c5dafd.jpeg" 
	}
	, {
		"id": 2
		, "filename": "CO22-KilloKill-1A.Chernarus"
		, "title": "CO22 KilloKill (1A)"
		, "player_count": 22
		, "terrain": "Chernarus"
		, "tags": []
		, "overview": "Takistan Army patrols wastelands"
		, "briefing": "14 марта 2012 года. Республика Такистан.<br /><br />Активность инсургентов резко возросла за последние месяцы, после открытых заявлений правительства США о введении санкций против Такистана.<br /><br />В связи с этим армия возобновляет патрулирования удаленных районов страны, чтобы пресечь попытки поставок оружия и наемников из пограничных областей"
			+ "<br /><br />А. Враждебные силы:<br />Маловероятно - инсургенты (племена роялистов), численностью до взвода."
			+ "<br /><br />Б. Дружественные силы:<br />2х моторизированные отделения Армии Такистана" 
			+ "<br/><br/>II. Задание:<br/>- Пройти по контрольным точкам КТ 1, КТ 2, КТ 3.<br />- В случае обнаружения инсургентов - сообщить штабу, при возможности - уничтожить."
			+ "<br/><br/>IV. Поддержка:<br />2х Land Rover (M2HB)<br />2x Land Rover" 
		, "map_shot": "https://img.rule34.xxx//images/3123/9f6b32d7f01af8a3558cfaed8ff96e4f.jpeg?3506572" 
	}
	, {
		"id": 5
		, "filename": "CO20_Operation_Pink_Citadel_1C.abramia"
		, "title": "CO20 The Pink Citadel (1C)"
		, "player_count": 20
		, "terrain": "abramia"
		, "tags": []
		, "overview": "Рейд KSK на потерянные территории с целью уничтожить ПВО и минометы боевиков"
		, "briefing": "<br /><br />I. Обстановка:<br />	Рост числа беженцев и их концетрация в землях Абрамии, северные острова ФРГ, привели к крупнейшему кризису в новейшей истории Германии. Недавно был принят закон об ужесточении миграционной политики для выходцев из ближневосточных стран, что ожидаемо вызвало волнения среди мигрантов из Ливии, Сирии и Афганистана. На континенте все более-менее успокоилось уже через несколько недель, однако в отдаленных землях ситуация резко ухудшалась - полиция не смогла удержать толпу и были захвачены полицейские арсеналы. Сейчас местные власти полностью потеряли контроль над ситуацией, а коренное насление начало панически покидать острова.<br /><br />     Вчера была атакована военная база Бундесвера на южном острове Абрамии и исламисты получили доступ к армейскому арсеналу, а также парку техники. Через 6 часов после этого мы получили сообщения о том, что боевики начали штурм города Белтрац, где расположен второй гарнизон армейцев. Судя по всему, исламисты собираются использовать захваченную технику для штурма и стягивают ее ближе к городу.<br /><br />     На текущий момент канцлер одобрил проведение силовой акции на островах, управление передано верховному командованию.<br />     Первый удар нанесут силы 2ого взвода 3ей роты KSK - противник завладел средствами ПВО и мы должны устранить эту опасность для основных ударных сил.<br /><br />А. Враждебные силы:<br />Исламские террористы - Нерегулярные войска<br />     до 1 взвода легкой пехоты<br />     2 самоходные зенитные системы M163 'Вулкан'<br />     80мм минометы и станковые пулеметы<br /><br />Б. Дружественные силы:<br />2ой взвод 3ей роты KSK - позывной Dolch-2 - Силы специального назначения<br />     2'1 - 9 чел.<br />     2'2 - 9 чел.<br />     2'6 - 2 чел.<br /><br />II. Задание:<br />1. Найти и уничтожить 2 установки М163 'Вулкан'<br />2. Найти и уничтожить минометную батарею боевиков<br />3. Обнаружить и навести штурмовики на вражескую технику (танки, MRAP)<br /><br />III. Выполнение:<br />- Инфильтрация будет происходить по методу HALO.<br />- Разведка сообщает, что в населенных пунктах орудуют вооруженные мародеры. Тем не менее вы сможете раздобыть там автотранспорт, рассмотрите эту опцию.<br />- Мы ожидаем, что 'Вулканы' будут где-то неподалеку от базы, т.к. это доминирующие высоты в районе.<br />- Минометы должны быть уничтожены с помощью взрывчатки (достаточно небольшого заряда), чтобы противник не смог ими воспользоваться после нашего отхода.<br />- Разведка считает, что захваченная техника (кроме ПВО) пока что не представляет опасности, т.к. боевики все еще ищут экипажи.<br />- Вызывайте штурмовики только после уничтожения ПВО противника! Вызов доступен из ACE меню для всех обладателей ДВ рации. Для вызова авиадуара следует передать координаты для удара.<br /><br />IV. Поддержка:<br />- 2х А-10C Thunderbolt-II, позывной 'Colt' (американские штурмовики ожидают координаты целей)<br />- 1x UH-1, позывной  'Spatz 1-1' (вертолет медэвакуации)<br /><br />Авиация будет доступна только после уничтожения ПВО в районе!<br /><br />V. Сигналы:<br />PL NET - LR 50MHz<br />SUP NET - LR 51Mhz<br />     2'1 - SR CH 1<br />     2'2 - SR CH 2<br />     2'6 - SR CH 6<br /><br />VI. Замечания:<br />Правила пользования парашютами<br />1) Оденьте рюкзаки на грудь:<br />ACE Self-Interaction (CTRL + WIN) -> Equipment -> Backpack on Chest<br />2) Возьмите парашют из ящика<br />3) Для того чтобы следить за высотой на которой вы находитесь, нажмите 'O' (часы). Рекомендуемая высота открытия парашюта 300 метров<br />4) Для открытия парашюта используйте Меню действий (по колесу мыши)<br />5) Постарайтесь приземлиться на ровную поверхность и с небольшой скоростью (кнопка S), вблизи союзных сил<br />6) После приземления, сбросьте с себя парашют (из инвентаря) и выполните:<br />ACE Self-Interaction (CTRL + WIN) -> Equipment -> BackPack on Back<br /><br />Наборы снаряжения<br />Т.к. мы десантируемся, то все несут по максимуму снаряжения:<br />- Лидеры команд - доп. боекопмплект к пулемету;<br />- Пулеметчик - боекомплект к пулемету;<br />- Гренадеры - доп. взрывчатку и второй ПТ-гранатомет;<br />- Стрелки/EOD - взрывчатку и ПТ-гранатомет<br /><br />VII. GSO notes:<br />- Минометчикам в общем-то не интересно ничего кроме стрельбы по городу. Но чтобы заставить их стрелять куда нужно - вытащите стрелков на несколько секунд из миномета, это должно прервать скрипт.<br />"
		, "map_shot": "https://img.rule34.xxx//images/2931/b1d039f0bcd20d9d3d1d77d567b48565.jpeg" 
	}
	, {
		id: 6
		, filename: "CO26-Business-Fall.Takistan"
		, title: "CO13 Business-Fall"
		, player_count: 13
		, terrain: "Takistan"
		, tags: []
		, overview: "SAR of the MVP in the Takistan mountains"
		, briefing: "<br /><br />I. Обстановка:<br />Описание ситуации<br /><br />А. Враждебные силы:<br />Описание вражеских сил<br /><br />Б. Дружественные силы:<br />Описание дружественных сил<br /><br />II. Задание:<br />Описание задач<br /><br />III. Выполнение:<br />Описание указаний по выполнению<br /><br />IV. Поддержка:<br />Доступная поддержка<br /><br />V. Сигналы:<br />Сигналы и радива<br /><br />VI. Замечания:<br />Прочие замечания"
		, map_shot: "https://img.rule34.xxx//images/3124/05542bc3d2e41a1a21370bc1e39b9cea.jpeg"
	}
	, {
		id: 1960040946
		,filename: "co29_operation_Mond-Pfad_1A.smd_sahrani_a3"
		,title: "Operation Mond-Pfad"
		,player_count: 29
		,terrain: "smd_sahrani_a3"
		,tags: []
		,overview: "Bundesvehr force attack isle"
		,briefing: "<br /><br />I. Situation:<br />В сферу  внимания MAD (военной контрразведки), после двух взрывов в районах, населенных беженцами из африканских республик, попала одна из активных «веток»  ультраправой НДПГ (национал- демократической партии Германии).  В соответствии с полученными данными, на острове, принадлежащем частному лицу, обустроен лагерь по подготовке военизированной ячейки.  Высокая организованность и скрытность, с которой действуют участники террористической группы, говорит о высоком уровне подготовки и подразумевает значительное количество участия отставных военных, недовольных существующей политикой государства.  Наличие, минимум двух зенитных установок уже говорит о серьёзности, организованной на острове, обороны. Фанатики, пропитанные идеей возрождения «Великой Германии», создали маленькую армию под носом у нашего правительства. Узнав о положении вещей, руководство дало чёткий приказ: Устранить угрозу. Разработка боевой задачи легла на плечи DSO ( Дивизии специальных операций Бундесвера)<br />Это совместная операция Егерей KSK и боевых пловцов KSKp. <br /><br /><br />A. Enemy Forces:<br />1. 1 х Взвод военизированной ячейки НДПГ<br />2. 2 х устновки ПВО (ЗУ-23)<br />3. ? х легкая техника (М2)<br />4. ? х стационарные пулемёты типа (КОРД)<br /><br />B. Friendly Forces:<br />1. 2 х отделения егерей Kommando Spezialkräfte<br />2. 1 х отделение боевых пловцов Kampfschwimmer<br /><br /><br />II. Mission:<br />1. Устранить ПВО<br />2. Ликвидировать живую силу противника на 2-х островах<br /><br /><br /><br />III. Execution:<br />По плану командира.<br /><br />IV. Service Support:<br />1. 5 х наводных плавсредств<br />2. 3 х малых подводных плавсредств<br /><br />V. Command & Signal:<br />1'4 - VHF    CH 5  50MGz MW<br />1'1 - V(U)HF CH 1        DW<br />1'2 - V(U)HF CH 2        DW<br />1'3 - V(U)HF CH 3        DW<br /><br />VI. Mission notes:<br />Powered by Tactical Shift Framework"
		,map_shot: "https://img.rule34.xxx//images/2879/6c5b12604146edcc3aca0e30c1058d54.jpeg"
	}
	, {
		id: 1404048045
		,filename: "CO26_Blessed_By_Fire_1A.cain"
		,title: "CO28 Blessed By Fire 1A"
		,player_count: 28
		,terrain: "cain"
		,tags: []
		,overview: "British Para platoon assaults argentine positions on Darwin Hill"
		,briefing: "<br /><br />I. Обстановка:<br />После высадки 21 мая на Фолклендских островах британская армия не предпринимала активных наступательных действий. Наконец 25 мая бригадный генерал Джулиан Томпсон получил приказ об атаке аргентинских позиций около н.п. Гуз-Грин и Дарвин. Части элитного 2-го парашютного батальона выдвинулись к точке сбора около ручья Камилла.<br /><br />Аргентинцы окопались на холме Дарвин и в районе аэродрома Гуз-Грин. На холме оборудованы траншеи, огневые точки для лёгких и тяжёлых пулемётов. На северных подходах к позициям установлены минные поля. Аэродром Гуз Грин представляет из себя неподготовленное лётное поле, поэтому охраняется слабо. Возможно наличие на аэродроме двух установок ПВО Oerlikon. <br /><br />Полчаса назад HMS Arrow начал обстрел аргентинских позиции около Дарвина. Вашему взводу предстоит провести атаку на южную часть холма Дарвин, после чего по возможности захватить аэродром Гуз-Грин.<br /><br /><br />А. Враждебные силы:<br />Рота С 15-го пехотного полка армии Аргентины<br />- Один взвод на Darwin Hill, усиленный станковыми пулемётами<br />- До двух отделений на Airfield <br />Поддержка<br />- Два 82-мм миномёта<br />- 2 ЗУ Oerlikon<br /><br />Внешний вид<br />- Тёмно-зелёная униформа<br />- Каска M1<br /><br />Вооружение<br />- FN FAL, FN MAG (M240), M2HB.<br /><br />Б. Дружественные силы:<br />Неполный 1-й взвод Роты A 2-го парашютного батальона армии Великобритании<br />- 1'1 - 8 чел.<br />- 1'2 - 8 чел.<br />- 1'0 - Командир взвода, GSO и авианаводчик<br /><br />Усиление:<br />- 1'4 - расчёт пулемёта L7A2 (M240), два расчёта гранатомёта Carl Gustav<br /><br />Авиация:<br />- 1 Harrier GR.3 с HMS Hermes<br /><br />II. Задание:<br />1. Захватить Darwin Hill<br />2. Уничтожить противника на Airfield (опц.)<br /><br /><br /><br />III. Выполнение:<br />План операции:<br />- 1-я фаза<br />Первым отделением (1'1) и отделением поддержки (1'4) занять BOF с видом на Darwin Hill. Вторым отделением (1'2) провести разведку Darwin Village. <br />- 2-я фаза<br />Начать обстрел Darwin Hill, вызвать артиллерийскую и авиационную поддержку. Подавить пулемёты для безопасного продвижения 1'2 к позициям противника. Используя Fire and Maneuver взять штурмом холм, при необходимости дождаться 1'1 и начать атаку вместе.<br />- 3-я фаза (доп.)<br />Наибольшую опасность на данной фазе представляет батарея ЗУ на аэродроме. Подавите их с помощью артиллерии или поставьте дымовую завесу, после чего  установите BOF и уничтожьте противника. Прямой штурм аэродрома нежелателен из отсутствия безопасного подхода к нему. <br /><br />IV. Поддержка:<br />Артиллерия<br />- Shelldrake-1-2 (2x 105мм гаубицы)<br />- Shelldrake 1-1 (3x 82мм миномёта)<br />Авиация<br />- 1x Harrier GR.3<br />Поддержка<br />- CCP c автомобилем для эвакуации<br /><br />V. Сигналы:<br />PL NET 50<br />SUPPORT NET 51<br />JTAC NET 55<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br />1'4 - SR CH 3<br />1'0 - SR CH 6<br /><br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />-"
		,map_shot: "https://img.rule34.xxx//images/2867/4a420c80ebc3b232c485fa5b2b70253f.jpeg"
	}
	, {
		id: 687388669
		,filename: "BLITZ12_Dusk_Party.Kunduz"
		,title: "BLITZ12 Dusk Party"
		,player_count: 16
		,terrain: "Kunduz"
		,tags: []
		,overview: "Czesh Special Forces provides force recon operation to destroy cache"
		,briefing: "<br /><br />I. Обстановка:<br />Талибан продолжает свою активность в провинции. Мы получили информацию, что недавно сюда прибыла крупная партия оружия и поставки все еще идет. <br /><br />Сегодня ночью должна состоятся очередная встреча между талибами и местными коллаборационистами, и это отличный шанс получить больше информации и накрыть сам склад.<br /><br />А. Враждебные силы:<br />Талибан, легкая пехота<br /><br />Б. Дружественные силы:<br />Спецназ ACR:<br />  - Dýka, 9 человек<br />  - Břitva, 9 человек<br /><br /><br />II. Задание:<br />1. Зачистить Obj.Pivo<br />2. Найти информацию о местоположении склада<br />3. Найти склад и уничтожить ящики с оружием/боеприпасами<br /><br /><br />III. Выполнение:<br />Первым делом зачистите Obj.Pivo и осмотритесь в поисках информации. В теории у местных должны быть какие-то карты с точками доставки - найдите их.<br /><br />Если вы сможете обнаружить местоположение склада - атакуйте немедленно и взорвите там все к чертям.<br /><br />Постарайтесь не уничтожить встреченные автомобили, они могут вам понадобиться.<br /><br />IV. Поддержка:<br />Нет<br /><br />V. Сигналы:<br />PL NET 50<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />- Нет"
		,map_shot: "https://img.rule34.xxx//images/3018/ced447978ac95f51961b10f5e951983484d553cc.jpg"
	}
	, {id: 619081715,filename: "CO16-Wastelands-1B.ProvingGrounds_PMC",title: "CO16 Wastelands (1B)",player_count: 16,terrain: "ProvingGrounds_PMC",tags: [],overview: "Takistan Army patrols wastelands",briefing: "<br /><br />I. Обстановка:<br />14 марта 2012 года. Республика Такистан.<br /><br />Активность инсургентов резко возросла за последние месяцы, после открытых заявлений правительства США о введении санкций против Такистана.<br /><br />В связи с этим армия возобновляет патрулирования удаленных районов страны, чтобы пресечь попытки поставок оружия и наемников из пограничных областей.<br /><br />А. Враждебные силы:<br />Маловероятно - инсургенты (племена роялистов), численностью до взвода.<br /><br />Б. Дружественные силы:<br />2х моторизированные отделения Армии Такистана<br /><br />II. Задание:<br />- Пройти по контрольным точкам КТ 1, КТ 2, КТ 3.<br />- В случае обнаружения инсургентов - сообщить штабу, при возможности - уничтожить.<br /><br />III. Выполнение:<br />Порядок контрольных точек не имеет значения.<br />Это патрульная операция, поэтому в первую очередь мы должны обнаружить присутствие противника, а не вступать с ним в бой. Отступление - приемлемое решение.<br /><br /><br />IV. Поддержка:<br />2х Land Rover (M2HB)<br />2x Land Rover<br /><br />V. Сигналы:<br />PL NET - LR 50<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br /><br />VI. Замечания:<br />- Нет<br /><br />VII. GSO notes:<br />- Поддержка недоступна ни игрокам, ни противникам (никакие AC-130 не прилетят)!",map_shot: ""},

{id: 412249837,filename: "CO20-CIA-Radarworks-1B.takistan",title: "CO20 CIA Radarworks (1B)",player_count: 20,terrain: "Takistan",tags: ["ARMOR","JTAC/CAS"],overview: "Уничтожение радара армии Такистана",briefing: "<br /><br />I. Обстановка:<br />Связь с нашими полевыми агентами, работавшими с роялистами в центральном Такистане, была потеряна несколько дней назад. Однако 10 часов назад мы получили информацию об их текущем местоположении и это, скорее всего, наш единственный шанс их спасти.<br /><br />Агенты удерживаются на небольшой базе такистанской армии в н.п. Джилавур. Судя по нашим данным, в районе есть бронетехника и значительные силы такистанцев, поэтому мы планируем привлечь авиацию для поддержки штурма.<br />Север центрального региона Такистана насыщен средствами ПВО, в том числе ЗУ и ЗРК. Чтобы дать дорогу авиации мы должны препятствовать нормальной работе ПВО противника.<br /><br />А. Враждебные силы:<br />Армия Такистана:<br />    до 2 взводов механизированной пехоты<br /><br />Б. Дружественные силы:<br />2 отделения ССО США<br /><br />II. Задание:<br />- Уничтожить радар у н.п. Феруз-Абад<br />- Отступить в Сахе<br /><br />III. Выполнение:<br />На усмотрение командира.<br />Противник не ждет силовых акций с нашей стороны, можете расчитывать на медлительность противника.<br /><br />IV. Поддержка:<br />- 4 гражданских автомобиля<br /><br />V. Сигналы:<br />PL NET - LR 50<br />    Delta 1'1 - SR CH 1<br />    Delta 1'2 - SR CH 2<br /><br />VI. Замечания:<br />- Нет<br /><br />VII. GSO notes:<br />- У противника есть минометы, скорость реакции не раньше 45 минут<br />- У противника есть авиация (Ми-24), скорость реакции не раньше 60 минут<br />- Противник может начать преследование<br />- Можно доспаунивать до 3 отделений пехоты на базе в Феруз-Абаде",map_shot: ""},

{id: 687388669,filename: "BLITZ12_Dusk_Party.Kunduz",title: "BLITZ12 Dusk Party",player_count: 16,terrain: "Kunduz",tags: [],overview: "Czesh Special Forces provides force recon operation to destroy cache",briefing: "<br /><br />I. Обстановка:<br />Талибан продолжает свою активность в провинции. Мы получили информацию, что недавно сюда прибыла крупная партия оружия и поставки все еще идет. <br /><br />Сегодня ночью должна состоятся очередная встреча между талибами и местными коллаборационистами, и это отличный шанс получить больше информации и накрыть сам склад.<br /><br />А. Враждебные силы:<br />Талибан, легкая пехота<br /><br />Б. Дружественные силы:<br />Спецназ ACR:<br />  - Dýka, 9 человек<br />  - Břitva, 9 человек<br /><br /><br />II. Задание:<br />1. Зачистить Obj.Pivo<br />2. Найти информацию о местоположении склада<br />3. Найти склад и уничтожить ящики с оружием/боеприпасами<br /><br /><br />III. Выполнение:<br />Первым делом зачистите Obj.Pivo и осмотритесь в поисках информации. В теории у местных должны быть какие-то карты с точками доставки - найдите их.<br /><br />Если вы сможете обнаружить местоположение склада - атакуйте немедленно и взорвите там все к чертям.<br /><br />Постарайтесь не уничтожить встреченные автомобили, они могут вам понадобиться.<br /><br />IV. Поддержка:<br />Нет<br /><br />V. Сигналы:<br />PL NET 50<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />- Нет",map_shot: ""},

{id: 1403522276,filename: "co20_operation_termite_1A.Malden",title: "Operation Termite",player_count: 20,terrain: "Malden",tags: [],overview: "police arrest suspect",briefing: "<br /><br />I. Обстановка:<br />Последнее время наши источники указывают на попытки организовать союз между мексиканским картелем и террористами с ближнего востока. Мы определили место встречи вассала с посланником картеля. Его необходимо допросить. Любой ценой доставьте подозреваемого живым. С мексиканцами не церемоньтесь, давно пора навести порядок в штате. Судья дал зеленый свет на устранение любой угрозы в близлежащих городах. <img image='suspect.jpg' width='256' height='256'/> <br /><br />А. Враждебные силы:<br />1. Около десяти человек латино-американского происхождения из банды картеля<br /><br />Б. Дружественные силы:<br />1. Сотрудники полицейского управления населённого пункта Ла Трините<br /><br />II. Задание:<br />1. Проверить информацию о выстрелах на территории мексиканского района в пригороде Эль Пасо<br />2. Найти и арестовать (Живым!) подозреваемого в указанном районе <br />3. Сопроводить подозреваемого в камеру временного содержания участка.<br /><br /><br />III. Выполнение:<br />По плану лейтенанта участка.<br /><br />IV. Поддержка:<br />1. 3х леговых полицейских автомобиля<br />2. 1х полицейский внедорожный пикап<br />3. 1х гражданский внедорожный автомобиль<br /><br />V. Сигналы:<br />PL NET 50<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />-ГСО также является штатным фельдшером",map_shot: ""},

{id: 988943444,filename: "CO21_One_Way_Ticket.lythium",title: "CO24 One Way Ticket 1A",player_count: 24,terrain: "Lythium",tags: [],overview: "German Bundeswehr platoon checks Razbula village for Taliban insurgents",briefing: "<br /><br />I. Обстановка:<br />Подготовка к операции 'Орёл' идет полным ходом и к нашему лагерю уже направлены дополнительные силы. Разведка пока не может похвастаться значительными результатами, однако уже сейчас становится ясно, что Талибан обеспокоен нашей активностью в районе.<br /><br />Сегодня утром патруль Афганской Национальной Армии подвергся миномётному обстрелу при подходе к н.п. Razbula. Данные с контрбатарейного радара показывают, что обстрел производился из центральной части кишлака Razbula. Также мы получили информацию об активности противника к югу от н.п. Anyakar.<br /><br />Командование полагает, что сегодняшний обстрел может сигнализировать о готовности Талибана начать крупное наступление до того как мы завершим подготовку к операции. Мы не можем позволить талибам собрать достаточно сил во время нашей перегруппировки, поэтому мы должны действовать на опережение теми силами, что имеем.<br />Таким образом перед взводом Бундесвера на FOB Fabian стоит задача в кратчайшие сроки провести разведку боем с целью найти и уничтожить миномётную позицию, и, по возможности, прочие силы противника.<br /><br />А. Враждебные силы:<br />Боевики Талибана - иррегулярные силы:<br />   предположительно до роты пехотинцев, усиленной миномётами и пулемётами.<br /><br />Б. Дружественные силы:<br />ISAF - Bundeswehr - Fallschirmjägerbataillon 263<br />1'1 - 9 чел.<br />1'2 - 9 чел.<br />1'6 - 2 чел.<br />Scharfschutze Gruppe - 2 чел. (снайперы)<br /><br />II. Задание:<br />1. Уничтожить миномёты в районе н.п. Razbula (отм. Mortar location)<br />2. (дополнительная задача) Найти и уничтожить противника в районе (отм. Enemy Activity)<br /><br />III. Выполнение:<br />Вы можете выполнять задачи в любом порядке. <br /><br />Н.п. Razbula окружён высотами с которых простреливается вся долина высохшей реки Yeray. Возможно наличие сил противника на этих высотах и вокруг них<br /><br />Имейте в виду, что дальности миномётов Stahlwerfer может не хватить на уничтожение целей в районе Anyakar.<br /><br />IV. Поддержка:<br />5x бронеавтомобиль Dingo (вооруженный, MG3 7.62)<br /><br />Поддержка:<br />3x 82-мм миномёта - позывной Stahlwerfer-1-1<br />1x вертолёт UH-1D - позывной Vogel-1-1<br />1x вертолёт CH-53G - позывной Vogel-1-2<br /><br />CCP и FARP на FOB Fabian<br /><br />V. Сигналы:<br />PL NET - LR 50 MHz<br />SUP NET - LR 51 MHz<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br />Scharfschutze Gruppe - SR CH 4<br /><br />VI. Замечания:<br />В машинах, вертолётах и рюкзаках гренадёров есть два подрывных заряда и взрыватель, используйте их для уничтожения миномётов. Там же вы можете найти гранатомёт Carl Gustav M3 и осколочные снаряды к нему. <br /><br />Дополнительные боеприпасы вы можете найти в ящиках на FOB FABIAN.<br /><br />В tS Notes представлен немецкий фонетический алфавит<br /><br />VII. Замечания для GSO:<br />Пытайтесь заставить ботов стрелять с дальних дистанций, используйте силы с зон QRF1 и QRF2(западнее Razbula и около Anyakar) для подкрепления основных сил.",map_shot: ""},

{id: 1504050147,filename: "CO23_Sleeping_Cell_1A.Takistan",title: "CO23 Sleeping Cell 1A",player_count: 23,terrain: "Takistan",tags: [],overview: "Takistan local insurgency operation VS Takistan Army",briefing: "<br /><br />I. Обстановка:<br />После ухода из Такистана американских оккупантов в стране началась очередная гражданская война. Такистанская Национальная Армия безуспешно пытается противостоять моджахедам в их священной борьбе. Кафиры провели в родной Афганистан интернет, что позволило нам намного быстрее разрабатывать планы по поиску и уничтожению гяурских главарей.<br /><br />Из твиттера командующего элитным подразделением Силы Шакала Юсуфа Амира мы узнали, что он прибыл на военную базу в центральном Такистане для плановой проверки боеготовности. Наши кибер-муджахиды смогли вычислить точное нахождение Юсуфа при помощи геотега из его последнего фото в инстаграмме. Юсуф пользуется большой популярностью в интернете и является секс-символом армии Такистана. Мы уничтожим его образ, морально унизив Юсуфа на глазах у всего мира! Но для этого надо захватить его живым, что сделает расположенная недалеко от базы спящая ячейка моджахедов. Хотя она и состоит из местных пастухов и деревенщины, это не мешает ей быть грозной боевой единицей.<br /><br />Наша цель находится на местной военной базе, которая долгое время была заброшенной. Совсем недавно там оказались расквартированы бойцы подразделения Силы Шакала. В Феруз-Абаде они прослыли великолепными любовниками и отчаянными любителями попарить кальян. Мы сомневаемся в их боевых качествах, но всё равно не следует недооценивать противника.<br /><br />А. Враждебные силы:<br />Подразделение Такистанской Национальной Армии Силы Шакала.<br /><br />Б. Дружественные силы:<br />Местная группа муджахидов из сёл Какару и Сакхе <br /><br />II. Задание:<br />1. Обезопасить один из подходов к базе<br />2. Штурмов взять базу и найти Юсуфа Амира<br />3. Вместе с Юсуфом вернуться в убежище для дальнейших развлечений<br /><br /><br />III. Выполнение:<br />Данная рекомендация разработана высшим военным советом муджахидов Такистана.<br /><br />Армейцы организовали два КПП на дороге и наблюдательный пункт на юге от базы. Восточный КПП основан на бывшем американском блокпосте, и потому укреплён сильнее, чем западный. Вашей первой задачей будет уничтожение КПП и захват дороги, ведущей к базе. При атаке установите позиции для ведения огня на юге от КПП и ослабьте его пулемётами и РПГ. После этого штурмуйте блокпост. На дороге к базе находятся патрули, будьте внимательны. После начала штурма базы вашей первоочередной целью будет поиск Юсуфа Амира. К этому времени, вероятно, с севера к вам начнут двигаться подкрепления кафиров. Действуйте быстро и выводите пленного как можно скорее, либо уничтожайте подкрепления и двигайтесь в убежище.<br /><br />IV. Поддержка:<br />CCP<br />Две машины по 6 мест<br />Грузовик<br />Пикап с ПК<br /><br />V. Сигналы:<br />Мы бедные боевики и денег хватило только на шесть Walkie-Talkie с рынка и четыре дальневолновые рации. Связь внутри взвода осуществляется через ДВ рации, которые есть у командира взвода и командиров отделений. Связь внутри отделения между командами производится при помощи КВ раций. У остальных игроков рации отсутствуют.<br /><br />Спящая ячейка - ДВ К50<br />1'1 - КВ К1<br />1'2 - КВ К2<br />1'3 - КВ К3<br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />Для победы надо доставить Юсуфа Амира на изначальную позицию<br />Подкрепление может не сработать, в этом случае направить его на базу после начала перестрелки на базе или около неё. При больших потерях сократить силу подкрепления самостоятельно.",map_shot: ""},

{id: 1404048045,filename: "CO26_Blessed_By_Fire_1A.cain",title: "CO28 Blessed By Fire 1A",player_count: 28,terrain: "Cain",tags: ["COMB.ARMS","ARMOR"],overview: "British Para platoon assaults argentine positions on Darwin Hill",briefing: "<br /><br />I. Обстановка:<br />После высадки 21 мая на Фолклендских островах британская армия не предпринимала активных наступательных действий. Наконец 25 мая бригадный генерал Джулиан Томпсон получил приказ об атаке аргентинских позиций около н.п. Гуз-Грин и Дарвин. Части элитного 2-го парашютного батальона выдвинулись к точке сбора около ручья Камилла.<br /><br />Аргентинцы окопались на холме Дарвин и в районе аэродрома Гуз-Грин. На холме оборудованы траншеи, огневые точки для лёгких и тяжёлых пулемётов. На северных подходах к позициям установлены минные поля. Аэродром Гуз Грин представляет из себя неподготовленное лётное поле, поэтому охраняется слабо. Возможно наличие на аэродроме двух установок ПВО Oerlikon. <br /><br />Полчаса назад HMS Arrow начал обстрел аргентинских позиции около Дарвина. Вашему взводу предстоит провести атаку на южную часть холма Дарвин, после чего по возможности захватить аэродром Гуз-Грин.<br /><br /><br />А. Враждебные силы:<br />Рота С 15-го пехотного полка армии Аргентины<br />- Один взвод на Darwin Hill, усиленный станковыми пулемётами<br />- До двух отделений на Airfield <br />Поддержка<br />- Два 82-мм миномёта<br />- 2 ЗУ Oerlikon<br /><br />Внешний вид<br />- Тёмно-зелёная униформа<br />- Каска M1<br /><br />Вооружение<br />- FN FAL, FN MAG (M240), M2HB.<br /><br />Б. Дружественные силы:<br />Неполный 1-й взвод Роты A 2-го парашютного батальона армии Великобритании<br />- 1'1 - 8 чел.<br />- 1'2 - 8 чел.<br />- 1'0 - Командир взвода, GSO и авианаводчик<br /><br />Усиление:<br />- 1'4 - расчёт пулемёта L7A2 (M240), два расчёта гранатомёта Carl Gustav<br /><br />Авиация:<br />- 1 Harrier GR.3 с HMS Hermes<br /><br />II. Задание:<br />1. Захватить Darwin Hill<br />2. Уничтожить противника на Airfield (опц.)<br /><br /><br /><br />III. Выполнение:<br />План операции:<br />- 1-я фаза<br />Первым отделением (1'1) и отделением поддержки (1'4) занять BOF с видом на Darwin Hill. Вторым отделением (1'2) провести разведку Darwin Village. <br />- 2-я фаза<br />Начать обстрел Darwin Hill, вызвать артиллерийскую и авиационную поддержку. Подавить пулемёты для безопасного продвижения 1'2 к позициям противника. Используя Fire and Maneuver взять штурмом холм, при необходимости дождаться 1'1 и начать атаку вместе.<br />- 3-я фаза (доп.)<br />Наибольшую опасность на данной фазе представляет батарея ЗУ на аэродроме. Подавите их с помощью артиллерии или поставьте дымовую завесу, после чего  установите BOF и уничтожьте противника. Прямой штурм аэродрома нежелателен из отсутствия безопасного подхода к нему. <br /><br />IV. Поддержка:<br />Артиллерия<br />- Shelldrake-1-2 (2x 105мм гаубицы)<br />- Shelldrake 1-1 (3x 82мм миномёта)<br />Авиация<br />- 1x Harrier GR.3<br />Поддержка<br />- CCP c автомобилем для эвакуации<br /><br />V. Сигналы:<br />PL NET 50<br />SUPPORT NET 51<br />JTAC NET 55<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br />1'4 - SR CH 3<br />1'0 - SR CH 6<br /><br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />-",map_shot: ""},


{id: 687388669,filename: "BLITZ12_Dusk_Party.Kunduz",title: "BLITZ12 Dusk Party",player_count: 16,terrain: "Kunduz",tags: ["randomshiet"],overview: "Czesh Special Forces provides force recon operation to destroy cache",briefing: "<br /><br />I. Обстановка:<br />Талибан продолжает свою активность в провинции. Мы получили информацию, что недавно сюда прибыла крупная партия оружия и поставки все еще идет. <br /><br />Сегодня ночью должна состоятся очередная встреча между талибами и местными коллаборационистами, и это отличный шанс получить больше информации и накрыть сам склад.<br /><br />А. Враждебные силы:<br />Талибан, легкая пехота<br /><br />Б. Дружественные силы:<br />Спецназ ACR:<br />  - Dýka, 9 человек<br />  - Břitva, 9 человек<br /><br /><br />II. Задание:<br />1. Зачистить Obj.Pivo<br />2. Найти информацию о местоположении склада<br />3. Найти склад и уничтожить ящики с оружием/боеприпасами<br /><br /><br />III. Выполнение:<br />Первым делом зачистите Obj.Pivo и осмотритесь в поисках информации. В теории у местных должны быть какие-то карты с точками доставки - найдите их.<br /><br />Если вы сможете обнаружить местоположение склада - атакуйте немедленно и взорвите там все к чертям.<br /><br />Постарайтесь не уничтожить встреченные автомобили, они могут вам понадобиться.<br /><br />IV. Поддержка:<br />Нет<br /><br />V. Сигналы:<br />PL NET 50<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />- Нет",map_shot: ""},

{id: 956091401,filename: "co13-business-fall.Takistan",title: "CO13 Business-Fall",player_count: 13,terrain: "Takistan",tags: ["RolePlay"],overview: "SAR of the MVP in the Takistan mountains",briefing: "",map_shot: ""},

{id: 619081715,filename: "CO16-Wastelands-1B.ProvingGrounds_PMC",title: "CO16 Wastelands (1B)",player_count: 16,terrain: "ProvingGrounds_PMC",tags: [],overview: "Takistan Army patrols wastelands",briefing: "<br /><br />I. Обстановка:<br />14 марта 2012 года. Республика Такистан.<br /><br />Активность инсургентов резко возросла за последние месяцы, после открытых заявлений правительства США о введении санкций против Такистана.<br /><br />В связи с этим армия возобновляет патрулирования удаленных районов страны, чтобы пресечь попытки поставок оружия и наемников из пограничных областей.<br /><br />А. Враждебные силы:<br />Маловероятно - инсургенты (племена роялистов), численностью до взвода.<br /><br />Б. Дружественные силы:<br />2х моторизированные отделения Армии Такистана<br /><br />II. Задание:<br />- Пройти по контрольным точкам КТ 1, КТ 2, КТ 3.<br />- В случае обнаружения инсургентов - сообщить штабу, при возможности - уничтожить.<br /><br />III. Выполнение:<br />Порядок контрольных точек не имеет значения.<br />Это патрульная операция, поэтому в первую очередь мы должны обнаружить присутствие противника, а не вступать с ним в бой. Отступление - приемлемое решение.<br /><br /><br />IV. Поддержка:<br />2х Land Rover (M2HB)<br />2x Land Rover<br /><br />V. Сигналы:<br />PL NET - LR 50<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br /><br />VI. Замечания:<br />- Нет<br /><br />VII. GSO notes:<br />- Поддержка недоступна ни игрокам, ни противникам (никакие AC-130 не прилетят)!",map_shot: ""},

{id: 412249837,filename: "CO20-CIA-Radarworks-1B.takistan",title: "CO20 CIA Radarworks (1B)",player_count: 20,terrain: "Takistan",tags: ["SPECOPS"],overview: "Уничтожение радара армии Такистана",briefing: "<br /><br />I. Обстановка:<br />Связь с нашими полевыми агентами, работавшими с роялистами в центральном Такистане, была потеряна несколько дней назад. Однако 10 часов назад мы получили информацию об их текущем местоположении и это, скорее всего, наш единственный шанс их спасти.<br /><br />Агенты удерживаются на небольшой базе такистанской армии в н.п. Джилавур. Судя по нашим данным, в районе есть бронетехника и значительные силы такистанцев, поэтому мы планируем привлечь авиацию для поддержки штурма.<br />Север центрального региона Такистана насыщен средствами ПВО, в том числе ЗУ и ЗРК. Чтобы дать дорогу авиации мы должны препятствовать нормальной работе ПВО противника.<br /><br />А. Враждебные силы:<br />Армия Такистана:<br />    до 2 взводов механизированной пехоты<br /><br />Б. Дружественные силы:<br />2 отделения ССО США<br /><br />II. Задание:<br />- Уничтожить радар у н.п. Феруз-Абад<br />- Отступить в Сахе<br /><br />III. Выполнение:<br />На усмотрение командира.<br />Противник не ждет силовых акций с нашей стороны, можете расчитывать на медлительность противника.<br /><br />IV. Поддержка:<br />- 4 гражданских автомобиля<br /><br />V. Сигналы:<br />PL NET - LR 50<br />    Delta 1'1 - SR CH 1<br />    Delta 1'2 - SR CH 2<br /><br />VI. Замечания:<br />- Нет<br /><br />VII. GSO notes:<br />- У противника есть минометы, скорость реакции не раньше 45 минут<br />- У противника есть авиация (Ми-24), скорость реакции не раньше 60 минут<br />- Противник может начать преследование<br />- Можно доспаунивать до 3 отделений пехоты на базе в Феруз-Абаде",map_shot: ""},

{id: 1930185437,filename: "CO20_Operation_Pink_Citadel_1C.abramia",title: "CO20 The Pink Citadel (1C)",player_count: 20,terrain: "Abramia",tags: [],overview: "Рейд KSK на потерянные территории с целью уничтожить ПВО и минометы боевиков",briefing: "<br /><br />I. Обстановка:<br />	Рост числа беженцев и их концетрация в землях Абрамии, северные острова ФРГ, привели к крупнейшему кризису в новейшей истории Германии. Недавно был принят закон об ужесточении миграционной политики для выходцев из ближневосточных стран, что ожидаемо вызвало волнения среди мигрантов из Ливии, Сирии и Афганистана. На континенте все более-менее успокоилось уже через несколько недель, однако в отдаленных землях ситуация резко ухудшалась - полиция не смогла удержать толпу и были захвачены полицейские арсеналы. Сейчас местные власти полностью потеряли контроль над ситуацией, а коренное насление начало панически покидать острова.<br /><br />     Вчера была атакована военная база Бундесвера на южном острове Абрамии и исламисты получили доступ к армейскому арсеналу, а также парку техники. Через 6 часов после этого мы получили сообщения о том, что боевики начали штурм города Белтрац, где расположен второй гарнизон армейцев. Судя по всему, исламисты собираются использовать захваченную технику для штурма и стягивают ее ближе к городу.<br /><br />     На текущий момент канцлер одобрил проведение силовой акции на островах, управление передано верховному командованию.<br />     Первый удар нанесут силы 2ого взвода 3ей роты KSK - противник завладел средствами ПВО и мы должны устранить эту опасность для основных ударных сил.<br /><br />А. Враждебные силы:<br />Исламские террористы - Нерегулярные войска<br />     до 1 взвода легкой пехоты<br />     2 самоходные зенитные системы M163 'Вулкан'<br />     80мм минометы и станковые пулеметы<br /><br />Б. Дружественные силы:<br />2ой взвод 3ей роты KSK - позывной Dolch-2 - Силы специального назначения<br />     2'1 - 9 чел.<br />     2'2 - 9 чел.<br />     2'6 - 2 чел.<br /><br />II. Задание:<br />1. Найти и уничтожить 2 установки М163 'Вулкан'<br />2. Найти и уничтожить минометную батарею боевиков<br />3. Обнаружить и навести штурмовики на вражескую технику (танки, MRAP)<br /><br />III. Выполнение:<br />- Инфильтрация будет происходить по методу HALO.<br />- Разведка сообщает, что в населенных пунктах орудуют вооруженные мародеры. Тем не менее вы сможете раздобыть там автотранспорт, рассмотрите эту опцию.<br />- Мы ожидаем, что 'Вулканы' будут где-то неподалеку от базы, т.к. это доминирующие высоты в районе.<br />- Минометы должны быть уничтожены с помощью взрывчатки (достаточно небольшого заряда), чтобы противник не смог ими воспользоваться после нашего отхода.<br />- Разведка считает, что захваченная техника (кроме ПВО) пока что не представляет опасности, т.к. боевики все еще ищут экипажи.<br />- Вызывайте штурмовики только после уничтожения ПВО противника! Вызов доступен из ACE меню для всех обладателей ДВ рации. Для вызова авиадуара следует передать координаты для удара.<br /><br />IV. Поддержка:<br />- 2х А-10C Thunderbolt-II, позывной 'Colt' (американские штурмовики ожидают координаты целей)<br />- 1x UH-1, позывной  'Spatz 1-1' (вертолет медэвакуации)<br /><br />Авиация будет доступна только после уничтожения ПВО в районе!<br /><br />V. Сигналы:<br />PL NET - LR 50MHz<br />SUP NET - LR 51Mhz<br />     2'1 - SR CH 1<br />     2'2 - SR CH 2<br />     2'6 - SR CH 6<br /><br />VI. Замечания:<br />Правила пользования парашютами<br />1) Оденьте рюкзаки на грудь:<br />ACE Self-Interaction (CTRL + WIN) -> Equipment -> Backpack on Chest<br />2) Возьмите парашют из ящика<br />3) Для того чтобы следить за высотой на которой вы находитесь, нажмите 'O' (часы). Рекомендуемая высота открытия парашюта 300 метров<br />4) Для открытия парашюта используйте Меню действий (по колесу мыши)<br />5) Постарайтесь приземлиться на ровную поверхность и с небольшой скоростью (кнопка S), вблизи союзных сил<br />6) После приземления, сбросьте с себя парашют (из инвентаря) и выполните:<br />ACE Self-Interaction (CTRL + WIN) -> Equipment -> BackPack on Back<br /><br />Наборы снаряжения<br />Т.к. мы десантируемся, то все несут по максимуму снаряжения:<br />- Лидеры команд - доп. боекопмплект к пулемету;<br />- Пулеметчик - боекомплект к пулемету;<br />- Гренадеры - доп. взрывчатку и второй ПТ-гранатомет;<br />- Стрелки/EOD - взрывчатку и ПТ-гранатомет<br /><br />VII. GSO notes:<br />- Минометчикам в общем-то не интересно ничего кроме стрельбы по городу. Но чтобы заставить их стрелять куда нужно - вытащите стрелков на несколько секунд из миномета, это должно прервать скрипт.<br />",map_shot: ""},

{id: 988943444,filename: "CO21_One_Way_Ticket.lythium",title: "CO24 One Way Ticket 1A",player_count: 24,terrain: "Lythium",tags: [],overview: "German Bundeswehr platoon checks Razbula village for Taliban insurgents",briefing: "<br /><br />I. Обстановка:<br />Подготовка к операции 'Орёл' идет полным ходом и к нашему лагерю уже направлены дополнительные силы. Разведка пока не может похвастаться значительными результатами, однако уже сейчас становится ясно, что Талибан обеспокоен нашей активностью в районе.<br /><br />Сегодня утром патруль Афганской Национальной Армии подвергся миномётному обстрелу при подходе к н.п. Razbula. Данные с контрбатарейного радара показывают, что обстрел производился из центральной части кишлака Razbula. Также мы получили информацию об активности противника к югу от н.п. Anyakar.<br /><br />Командование полагает, что сегодняшний обстрел может сигнализировать о готовности Талибана начать крупное наступление до того как мы завершим подготовку к операции. Мы не можем позволить талибам собрать достаточно сил во время нашей перегруппировки, поэтому мы должны действовать на опережение теми силами, что имеем.<br />Таким образом перед взводом Бундесвера на FOB Fabian стоит задача в кратчайшие сроки провести разведку боем с целью найти и уничтожить миномётную позицию, и, по возможности, прочие силы противника.<br /><br />А. Враждебные силы:<br />Боевики Талибана - иррегулярные силы:<br />   предположительно до роты пехотинцев, усиленной миномётами и пулемётами.<br /><br />Б. Дружественные силы:<br />ISAF - Bundeswehr - Fallschirmjägerbataillon 263<br />1'1 - 9 чел.<br />1'2 - 9 чел.<br />1'6 - 2 чел.<br />Scharfschutze Gruppe - 2 чел. (снайперы)<br /><br />II. Задание:<br />1. Уничтожить миномёты в районе н.п. Razbula (отм. Mortar location)<br />2. (дополнительная задача) Найти и уничтожить противника в районе (отм. Enemy Activity)<br /><br />III. Выполнение:<br />Вы можете выполнять задачи в любом порядке. <br /><br />Н.п. Razbula окружён высотами с которых простреливается вся долина высохшей реки Yeray. Возможно наличие сил противника на этих высотах и вокруг них<br /><br />Имейте в виду, что дальности миномётов Stahlwerfer может не хватить на уничтожение целей в районе Anyakar.<br /><br />IV. Поддержка:<br />5x бронеавтомобиль Dingo (вооруженный, MG3 7.62)<br /><br />Поддержка:<br />3x 82-мм миномёта - позывной Stahlwerfer-1-1<br />1x вертолёт UH-1D - позывной Vogel-1-1<br />1x вертолёт CH-53G - позывной Vogel-1-2<br /><br />CCP и FARP на FOB Fabian<br /><br />V. Сигналы:<br />PL NET - LR 50 MHz<br />SUP NET - LR 51 MHz<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br />Scharfschutze Gruppe - SR CH 4<br /><br />VI. Замечания:<br />В машинах, вертолётах и рюкзаках гренадёров есть два подрывных заряда и взрыватель, используйте их для уничтожения миномётов. Там же вы можете найти гранатомёт Carl Gustav M3 и осколочные снаряды к нему. <br /><br />Дополнительные боеприпасы вы можете найти в ящиках на FOB FABIAN.<br /><br />В tS Notes представлен немецкий фонетический алфавит<br /><br />VII. Замечания для GSO:<br />Пытайтесь заставить ботов стрелять с дальних дистанций, используйте силы с зон QRF1 и QRF2(западнее Razbula и около Anyakar) для подкрепления основных сил.",map_shot: ""},

{id: 1504050147,filename: "CO23_Sleeping_Cell_1A.Takistan",title: "CO23 Sleeping Cell 1A",player_count: 23,terrain: "Takistan",tags: [],overview: "Takistan local insurgency operation VS Takistan Army",briefing: "<br /><br />I. Обстановка:<br />После ухода из Такистана американских оккупантов в стране началась очередная гражданская война. Такистанская Национальная Армия безуспешно пытается противостоять моджахедам в их священной борьбе. Кафиры провели в родной Афганистан интернет, что позволило нам намного быстрее разрабатывать планы по поиску и уничтожению гяурских главарей.<br /><br />Из твиттера командующего элитным подразделением Силы Шакала Юсуфа Амира мы узнали, что он прибыл на военную базу в центральном Такистане для плановой проверки боеготовности. Наши кибер-муджахиды смогли вычислить точное нахождение Юсуфа при помощи геотега из его последнего фото в инстаграмме. Юсуф пользуется большой популярностью в интернете и является секс-символом армии Такистана. Мы уничтожим его образ, морально унизив Юсуфа на глазах у всего мира! Но для этого надо захватить его живым, что сделает расположенная недалеко от базы спящая ячейка моджахедов. Хотя она и состоит из местных пастухов и деревенщины, это не мешает ей быть грозной боевой единицей.<br /><br />Наша цель находится на местной военной базе, которая долгое время была заброшенной. Совсем недавно там оказались расквартированы бойцы подразделения Силы Шакала. В Феруз-Абаде они прослыли великолепными любовниками и отчаянными любителями попарить кальян. Мы сомневаемся в их боевых качествах, но всё равно не следует недооценивать противника.<br /><br />А. Враждебные силы:<br />Подразделение Такистанской Национальной Армии Силы Шакала.<br /><br />Б. Дружественные силы:<br />Местная группа муджахидов из сёл Какару и Сакхе <br /><br />II. Задание:<br />1. Обезопасить один из подходов к базе<br />2. Штурмов взять базу и найти Юсуфа Амира<br />3. Вместе с Юсуфом вернуться в убежище для дальнейших развлечений<br /><br /><br />III. Выполнение:<br />Данная рекомендация разработана высшим военным советом муджахидов Такистана.<br /><br />Армейцы организовали два КПП на дороге и наблюдательный пункт на юге от базы. Восточный КПП основан на бывшем американском блокпосте, и потому укреплён сильнее, чем западный. Вашей первой задачей будет уничтожение КПП и захват дороги, ведущей к базе. При атаке установите позиции для ведения огня на юге от КПП и ослабьте его пулемётами и РПГ. После этого штурмуйте блокпост. На дороге к базе находятся патрули, будьте внимательны. После начала штурма базы вашей первоочередной целью будет поиск Юсуфа Амира. К этому времени, вероятно, с севера к вам начнут двигаться подкрепления кафиров. Действуйте быстро и выводите пленного как можно скорее, либо уничтожайте подкрепления и двигайтесь в убежище.<br /><br />IV. Поддержка:<br />CCP<br />Две машины по 6 мест<br />Грузовик<br />Пикап с ПК<br /><br />V. Сигналы:<br />Мы бедные боевики и денег хватило только на шесть Walkie-Talkie с рынка и четыре дальневолновые рации. Связь внутри взвода осуществляется через ДВ рации, которые есть у командира взвода и командиров отделений. Связь внутри отделения между командами производится при помощи КВ раций. У остальных игроков рации отсутствуют.<br /><br />Спящая ячейка - ДВ К50<br />1'1 - КВ К1<br />1'2 - КВ К2<br />1'3 - КВ К3<br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />Для победы надо доставить Юсуфа Амира на изначальную позицию<br />Подкрепление может не сработать, в этом случае направить его на базу после начала перестрелки на базе или около неё. При больших потерях сократить силу подкрепления самостоятельно.",map_shot: ""},

{id: 1404048045,filename: "CO26_Blessed_By_Fire_1A.cain",title: "CO28 Blessed By Fire 1A",player_count: 28,terrain: "Cain",tags: [],overview: "British Para platoon assaults argentine positions on Darwin Hill",briefing: "<br /><br />I. Обстановка:<br />После высадки 21 мая на Фолклендских островах британская армия не предпринимала активных наступательных действий. Наконец 25 мая бригадный генерал Джулиан Томпсон получил приказ об атаке аргентинских позиций около н.п. Гуз-Грин и Дарвин. Части элитного 2-го парашютного батальона выдвинулись к точке сбора около ручья Камилла.<br /><br />Аргентинцы окопались на холме Дарвин и в районе аэродрома Гуз-Грин. На холме оборудованы траншеи, огневые точки для лёгких и тяжёлых пулемётов. На северных подходах к позициям установлены минные поля. Аэродром Гуз Грин представляет из себя неподготовленное лётное поле, поэтому охраняется слабо. Возможно наличие на аэродроме двух установок ПВО Oerlikon. <br /><br />Полчаса назад HMS Arrow начал обстрел аргентинских позиции около Дарвина. Вашему взводу предстоит провести атаку на южную часть холма Дарвин, после чего по возможности захватить аэродром Гуз-Грин.<br /><br /><br />А. Враждебные силы:<br />Рота С 15-го пехотного полка армии Аргентины<br />- Один взвод на Darwin Hill, усиленный станковыми пулемётами<br />- До двух отделений на Airfield <br />Поддержка<br />- Два 82-мм миномёта<br />- 2 ЗУ Oerlikon<br /><br />Внешний вид<br />- Тёмно-зелёная униформа<br />- Каска M1<br /><br />Вооружение<br />- FN FAL, FN MAG (M240), M2HB.<br /><br />Б. Дружественные силы:<br />Неполный 1-й взвод Роты A 2-го парашютного батальона армии Великобритании<br />- 1'1 - 8 чел.<br />- 1'2 - 8 чел.<br />- 1'0 - Командир взвода, GSO и авианаводчик<br /><br />Усиление:<br />- 1'4 - расчёт пулемёта L7A2 (M240), два расчёта гранатомёта Carl Gustav<br /><br />Авиация:<br />- 1 Harrier GR.3 с HMS Hermes<br /><br />II. Задание:<br />1. Захватить Darwin Hill<br />2. Уничтожить противника на Airfield (опц.)<br /><br /><br /><br />III. Выполнение:<br />План операции:<br />- 1-я фаза<br />Первым отделением (1'1) и отделением поддержки (1'4) занять BOF с видом на Darwin Hill. Вторым отделением (1'2) провести разведку Darwin Village. <br />- 2-я фаза<br />Начать обстрел Darwin Hill, вызвать артиллерийскую и авиационную поддержку. Подавить пулемёты для безопасного продвижения 1'2 к позициям противника. Используя Fire and Maneuver взять штурмом холм, при необходимости дождаться 1'1 и начать атаку вместе.<br />- 3-я фаза (доп.)<br />Наибольшую опасность на данной фазе представляет батарея ЗУ на аэродроме. Подавите их с помощью артиллерии или поставьте дымовую завесу, после чего  установите BOF и уничтожьте противника. Прямой штурм аэродрома нежелателен из отсутствия безопасного подхода к нему. <br /><br />IV. Поддержка:<br />Артиллерия<br />- Shelldrake-1-2 (2x 105мм гаубицы)<br />- Shelldrake 1-1 (3x 82мм миномёта)<br />Авиация<br />- 1x Harrier GR.3<br />Поддержка<br />- CCP c автомобилем для эвакуации<br /><br />V. Сигналы:<br />PL NET 50<br />SUPPORT NET 51<br />JTAC NET 55<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br />1'4 - SR CH 3<br />1'0 - SR CH 6<br /><br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />-",map_shot: ""},

{id: 656359690,filename: "CO26_Operation_first_steps.zargabad",title: "CO26 First Steps",player_count: 26,terrain: "Zargabad",tags: [],overview: "Повстанцы атакуют правительственные войска.",briefing: "<br /><br />I. Обстановка:<br />Уже довольно долгое время власть поддерживаемая армией терроризирует свой народ. Города пустуют, кругом развалины и все это в то время, когда практически вся наша нефть выкачивается западом за бесценок. Большая часть населения свыклась с этим, но пора поднять народ, сегодня мы попытаемся хоть что-то изменить. Нашей целью является убийство местного офицера, отвечающего за контроль данного региона, а также необходимо освободить арестованных старейшин. Офицер сейчас находится в своей вилле, которую помимо местной армии охраняют западные наемники, старейшины в данный момент находятся там же.<br /><br /><br />А. Враждебные силы:<br />Армия Такистана - регулярные силы<br />        до 2 взводов.<br />Западные наемники - регулярные силы<br />        около 2 отделений.<br />Возможные подкрепления из соседних районов.<br /><br />Б. Дружественные силы:<br />Силы повстанцев.<br />    1'1 - 8 чел.<br />    1'2 - 8 чел.<br />    1'3 - 8 чел.<br />    1'0 - 2 чел.<br /><br />II. Задание:<br />1. Ликвидировать местного офицера.<br />2. Освободить арестованных старейшин и доставить их в Shahbaz.<br />3. Вывезти оружие с военной базы в Shahbaz (опционально). <br /><br /><br />III. Выполнение:<br />- На данный момент у нас нет рабочих раций, скорее всего их можно будет забрать с трупов кафиров или на военной базе.<br />- Предварительный рейд на военную базу выглядит крайне выгодным - мы сможем значительно увеличить нашу огневую мощь и, если повезет, уничтожим возможные подкрепления противника при штурме виллы. По возможности - вывезите все снаряжение в поселок Shahbaz, оттуда его заберут наши люди.<br />- У нас имеется несколько взрывпакетов, по желанию можем выбрать человека готового пожертвовать своей жизнью, во имя благой цели.<br /><br /><br />IV. Поддержка:<br />2x грузовик Praga V3S (невооруженный)<br />2x пикап Datsun 620 Pickup (невооруженный)<br />1x фургон Skoda 1203 (невооруженный)<br /><br /><br />V. Сигналы:<br />'<br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />- Будут два реинфорса, они заскриптованы и работают, одно подлетит на military base (иногда высаживает подкерпы далеко, после чего пустой следует по маршруту), другое подъедет на виллу.<br />- Если игроки будт возиться на территории вилы (минут 5-7), но так и не зайдут в здание с офицером, надо будет помочь ему уехать/улететь , для этого есть вертолет и машинки на территории.",map_shot: ""},

{id: 94516762,filename: "CO26_White_dust_1A.abramia",title: "CO26 White Dust",player_count: 26,terrain: "Abramia",tags: [],overview: "Pmc raid on russian oil facility in Antarctic.",briefing: "<br /><br />I. Обстановка:<br />Власти НРФ, вооруженным путем, захватывают остров Буве принадлежащий Норвегии. Норвежцы опасаясь начала крупного вооруженного конфликта, сдают остров без боестолкновений, оставив захватчикам своих ученных с важными данными о разведке месторождений.<br />Нашей задачей, как ЧВК, является эвакуация ученных и данных оставшихся на станции 'Førti'.<br /><br />А. Враждебные силы:<br />Войска специального назначения НРФ - элитные силы.<br />        Около 1 взвода.<br /><br />Б. Дружественные силы:<br />ЧВК 'Анод' - регулярные силы.<br />        1'1 - 9 чел.<br />        1'2 - 9 чел.<br />        1'3 - 9 чел.<br />        1'6 - 2 чел.<br /><br />II. Задание:<br />1. Найти и вывести ученых.<br />2. Найти компьютер с данными.<br />3. Эвакуироваться.<br /><br />III. Выполнение:<br />По плану командира.<br /><br />IV. Поддержка:<br />2x - 'Мерлин' (Транспортный вертолет)<br />4x - 'Литл Берд' (Невооруженный)<br /><br />V. Сигналы:<br />PL NET 50<br />SUP NET 51<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br />1'3 - SR CH 3<br />1'6 - SR CH 6<br /><br /><br />VI. Замечания:<br />Powered by Tactical Shift Framework<br /><br />VII. Замечания для GSO:<br />- Если игроки завязли на objective, высылай ми-24.",map_shot: ""},

{id: 1411051965,filename: "CO29_My_Summer_Tanks.ruha",title: "CO29 My Summer Tanks",player_count: 29,terrain: "Ruha",tags: ["COMB.ARMS"],overview: "UK Platoon with support of tanks assaults soviet entrenched company sized forces",briefing: "<br /><br />I. Обстановка:<br />Силы Ее Величества продолжают наступать на северо-восток по MSR WAY, по сельской местности к западу от шоссе номер 5. На данный момент отступающие соединения Советской Армии смогли перегруппироваться и занять оборону около н.п. Ruha. <br /><br />Нашей роте, усиленной 1ым танковым полком, предстоит выбить противника с оборонительных позиций, а также захватить мост в н.п. Ruha. <br /><br />В данный момент 1ый взвод и часть 1ого танкового полка находятся на CP MARTINI, в то время как 2ой взвод переправился через реку и готовится к наступлению по правому берегу.<br /><br />А. Враждебные силы:<br />Советская Армия - регулярные силы:<br />     около 1 роты мотострелков на БМП-2<br />     до 1 танкового взвода на Т-72<br />     станковые ККП и ПТО, возможно ПТУР<br />     82мм минометы<br /><br />Противник смог оборудовать окопы и бункеры на OBJ HAMMER. Также окопы замечены в районе н.п. Hyyppa (левый фланг). Вероятные оборонительные оборонительные позиции отмечены на карте. <br /><br />На переднем крае обороны противника замечены разведывательные патрули и БРДМ. <br /><br />Противник также разместил небольшие гарнизоны в н.п. Ojankula, Hyyppa и Ohmenluoma.<br /><br />Б. Дружественные силы:<br />1st platoon, A Company, 1st Battalion, Royal Regiment of Fusiliers, British Army:<br />     1'0 - 2 чел.<br />     1'1 - 8 чел.<br />     1'2 - 8 чел.<br />     1'3 - 8 чел.<br /><br />1st Company, Spear squadron, 3 Royal Tank Regiment<br />     - Spear-1-1 - 3 чел. на Challenger 1<br /><br />Миномётная позиция Steel Rain 1-1<br />2-й взвод к юго-восток от шоссе номер 5<br /><br />II. Задание:<br />1. Захватить OBJ HAMMER<br />2. Захватить OBJ NAIL<br />3. По возможности найти и уничтожить миномётную батарею противника<br /><br /><br />III. Выполнение:<br />Известные оборонительные позиции отмечены на карте, но стоит учитывать, что вражеские мобильные группы могут действовать и на флангах. Также стоит ожидать, что противник расположил средства ПТО для прикрытия танкоопасного направления вдоль MSR WAY.<br /><br />По данным разведки, противник располагает примерно 4 танками Т-72. Скорее всего они окопаны и замаскированы рядом с основными позициями. <br /><br />Противнику оказывает поддержку батарея 82мм миномётов роты, точный огонь будут обеспечивать корректировщики. <br /><br />Мы предполагаем, что противник продолжит занимать оборонительные позиции до последнего. <br />Вражеские резервы оцениваются в два отделения мотопехоты на БМП-2. В худшем для нас случае они смогут достичь зоны операции через 60 минут после запроса.<br /><br />IV. Поддержка:<br />3x БТР FV432<br />1x танк Challenger 1<br />4x автомобиль Land Rover 110<br /><br />Транспортный вертолёт SA-330, позывной Gremlin-1-3<br />Миномётная батарея 82мм, позывной Steel Rain 1-1<br /><br />CCP<br />FARP<br /><br />Резерв:<br />2х Танк Challenger 1<br />3x БТР FV432x<br /><br />V. Сигналы:<br />PL NET 50<br />PL SUP NET 51<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br />1'3 - SR CH 3<br /><br />VI. Замечания:<br />1. КВ Рации есть только у СЛ-а и ФТЛ, Пользуйтесь свистками при необходимости<br />2. Река на нашем правом фланге считается непроходимой!<br />3. Зона, отмеченная красной штриховкой, недоступна для операции.<br />4. Для использования пониженной передачи на танке нужно нажать ''вперед + Левый Shift'', для движения назад - ''Назад + Правый Shift''<br /><br />VII. Замечания для GSO:<br />Вы играете за красную сторону. Используйте имеющиеся ассеты для создания противодействия игрокам. <br /><br />Противник имеет батарею из 4 миномётов:<br />- наводить их могут только юниты с ДВ рацией, а также юниты в импровизированных штабах (например, в бункере): добавьте ассеты ДВ раций (статичный объект или рюкзак для юнита), но не более 2 участке фронта в 2км<br />- минометчики СА способны вести беспокоящий огонь (широким фронтом, с 30-90 секундным промежутками между снарядами) по заранее известным позициям: выберите 3 заранее известные позиции; впоследующем вы можете вести медленный и не точный огонь по этим позициям после того как ваши юниты погибнут/отступят <br /><br />Резерв: 1 отделение на БМП-2, 1 отделение на БТР-60<br />- После первых огневых контактов вы можете 'запросить' подкрепление, однако разрешается спаунить его не ранее чем через 60 минут<br />- Используйте подкрепления для фланговых и тыловых ударов по наступающим игрокам",map_shot: ""},

{id: 1960040946,filename: "co29_operation_Mond-Pfad_1A.smd_sahrani_a3",title: "Operation Mond-Pfad",player_count: 29,terrain: "Smd_sahrani_a3",tags: [],overview: "Bundesvehr force attack isle",briefing: "<br /><br />I. Situation:<br />В сферу  внимания MAD (военной контрразведки), после двух взрывов в районах, населенных беженцами из африканских республик, попала одна из активных «веток»  ультраправой НДПГ (национал- демократической партии Германии).  В соответствии с полученными данными, на острове, принадлежащем частному лицу, обустроен лагерь по подготовке военизированной ячейки.  Высокая организованность и скрытность, с которой действуют участники террористической группы, говорит о высоком уровне подготовки и подразумевает значительное количество участия отставных военных, недовольных существующей политикой государства.  Наличие, минимум двух зенитных установок уже говорит о серьёзности, организованной на острове, обороны. Фанатики, пропитанные идеей возрождения «Великой Германии», создали маленькую армию под носом у нашего правительства. Узнав о положении вещей, руководство дало чёткий приказ: Устранить угрозу. Разработка боевой задачи легла на плечи DSO ( Дивизии специальных операций Бундесвера)<br />Это совместная операция Егерей KSK и боевых пловцов KSKp. <br /><br /><br />A. Enemy Forces:<br />1. 1 х Взвод военизированной ячейки НДПГ<br />2. 2 х устновки ПВО (ЗУ-23)<br />3. ? х легкая техника (М2)<br />4. ? х стационарные пулемёты типа (КОРД)<br /><br />B. Friendly Forces:<br />1. 2 х отделения егерей Kommando Spezialkräfte<br />2. 1 х отделение боевых пловцов Kampfschwimmer<br /><br /><br />II. Mission:<br />1. Устранить ПВО<br />2. Ликвидировать живую силу противника на 2-х островах<br /><br /><br /><br />III. Execution:<br />По плану командира.<br /><br />IV. Service Support:<br />1. 5 х наводных плавсредств<br />2. 3 х малых подводных плавсредств<br /><br />V. Command & Signal:<br />1'4 - VHF    CH 5  50MGz MW<br />1'1 - V(U)HF CH 1        DW<br />1'2 - V(U)HF CH 2        DW<br />1'3 - V(U)HF CH 3        DW<br /><br />VI. Mission notes:<br />Powered by Tactical Shift Framework",map_shot: ""},

{id: 225799033,filename: "JTF-CO56-Apologies-for-Mr-K-1A.Altis",title: "JTF-CO56 Apologies for Mr K. (1B)",player_count: 56,terrain: "Altis",tags: [],overview: "Syrian JTF seizes town from besplatniky",briefing: "<br /><br />I. Обстановка:<br />Cирийская Арабская Армия совместно со специальным подразделением Охотники на ИГИЛ проводит операцию по уничтожению террористов Тахрир Аш-Шам на севере мухафазы Идлиб. Сегодня нам предстоит отбить город в котором укрепились боевики. Командование предполагает, что у нас хватает сил захватить н.п, однако ситуацию осложняет один факт: в городе содержатся пленные чеченские агенты. Некий господин К. лично попросил командующих операцией проследить за сохранностью его соотечественников. Если мы не хотим извиняться перед ним всю оставшуюся жизнь, нам следует выполнить данный приказ во что бы то ни стало.<br /><br />Армейская разведка и авиация установили, что высоты около города заняты боевиками различных группировок, составляющих Тахрир Аш-Шам. Сам город относительно небольшой и давно покинут мирными жителями. <br /><br />Аллах, Сирия, Башар!<br /><br /><br />А. Враждебные силы:<br />До взвода боевиков в городе и на высотах вокруг. Противник обладает стрелковым вооружением, средствами ПТО, включая ПТРК. Также установлено наличие у него станковых крупнокалиберных и зенитных пулемётов, миномётов.<br /><br />Б. Дружественные силы:<br />2x штурмовых отряда ISIS Hunter (Hunter 1'1 и Hunter 1'2)<br />2x мотострелковых отделения САА (Ифрис 1'3 и Ифрис 1'4)<br />1x отделение поддержки (ПТРК и АГС, Ифрис 1'5)<br /><br />II. Задание:<br />1. Захватить н.п. Galati<br />2. Освободить пленных чеченцев и сопроводить их к точке сбора<br /><br /><br />III. Выполнение:<br />По плану командира.<br /><br />В первую очередь нам нужно спасти заложников (потом ВКС РФ смогут сравнять город с землей). Однако если мы обнаружим, что заложники убиты - нам придется зачистить город своими силами и наказать всех причастных к казни, а головы бармалеев доставить в качестве извинений господину К.<br /><br />IV. Поддержка:<br />1x БМП-1<br />1x БТР-70<br />2x Техничка с ЗУ-23-2<br />2x Урал <br />1x Гражданский грузовик (с доп. патронами для отделения поддержки)<br />2x Легковая машина Тойота<br /><br />Минометная батарея (позывной 'Шуган')<br /><br />V. Сигналы:<br />PL NET 50<br />SUPP NET 51<br />1'1 - SR CH 1<br />1'2 - SR CH 2<br />1'3 - SR CH 3<br />1'4 - SR CH 4<br />1'5 - SR CH 5<br />1'6 - SR CH 6<br /><br />VI. Замечания:<br />О, Аллах! Ты являешь и нашим Господином и их Господином. Наши сердца и их сердца в Твоих руках. Наша победа зависит только от Тебя. (Навави, аль-Азкар: 189)<br /><br />VII. Замечания для GSO:<br />- Миномет на базе бесплатников может быть использован против игроков<br />- Активно используйте статики (ПТРК и ЗУ-23-2) на высотках<br />- Предусмотрено подкрепление из БМП-1 и грузовика с пехотой (условие - игроки входят в город, переменная ReinforcementCalled), имеет смысл высадить пехоту до достижения города",map_shot: ""}

];

var TagsMarkdown = {
	"SPECOPS": { 		bg: "#8ab62f", text: "whitesmoke" },
	"INFANTRY": {		bg: "#ba2b2b", text: "whitesmoke" },
	"COMB.ARMS": {		bg: "#596816", text: "whitesmoke" },
	"JTAC/CAS": { 		bg: "#6aa29e", text: "whitesmoke" },
	"ARMOR": { 			bg: "#986f2a", text: "whitesmoke" },
	"RolePlay":  { 		bg: "#ae33ff", text: "whitesmoke" },
	"default": { 		bg: "#8374aa", text: "whitesmoke" }
};

var GridModelClass = function (data) {
	this.data = [...data];
	this.size = data.length;
	this.sortedBy = { field: "", order: true };

	this.filteredOut = [];
	this.filter = {
		byString: function (v, vTofind) {
			return (v.toLocaleLowerCase()).indexOf(vTofind.toLocaleLowerCase()) >= 0;
		}
		, byNumberGTE: function (v, vToFind) {
			return vToFind <= v;
		}
		, byNumberLTE: function (v, vToFind) {
			return vToFind >= v;
		}

		, terrainValues: []
		, field2filter: {
			title: "byString"
			, terrain: "byString"
			, slotsFrom: "byNumberGTE"
			, slotsTo: "byNumberLTE"
		}
		, field2scheme: {
			title: "title"
			, terrain: "terrain"
			, slotsFrom: "player_count"
			, slotsTo: "player_count"
		}
	}

	this.view = null;

	this.sortBy = function (param) {
		let order = true;
		if (this.sortedBy.field == param) { // Toggles sort order if already sorted
			order = !this.sortedBy.order;
		}

		this.sortColumnWithOrder(param, order);
	};

	this.sortColumnWithOrder = function (param, isAscending) {
		this.data.sort(function (a,b) {
			let v1 = a[param];
			let v2 = b[param];
			let r = 0;
			
			if (v1 > v2) {
				r = 1;
			} else if (v1 < v2) {
				r = -1;
			} else {
				r = 0;
			}

			return isAscending ? r : -1 * r;
		});

		this.sortedBy.field = param;
		this.sortedBy.order = isAscending;

		this.refreshView();
		return;
	};

	this.filterBy = function (filterData) {
		this.resetFilter();
		
		if (filterData.length == 0) { // Exit on filter reset action
			this.refreshView(); 
			return; 
		}

		let filteredIndexes = [];
		for (let i = 0; i < filterData.length; ++i) {
			let filterField = filterData[i][0];
			let filterValue = filterData[i][1];

			let filterType = this.filter.field2filter[filterField];
			let schemeField = this.filter.field2scheme[filterField];

			let filterFunction = this.filter[filterType];
			this.data.forEach(function (el) {
				let result = filterFunction(el[schemeField], filterValue);

				// Add indexes that not correspond to filter value to filteredIndexeses

				if (!result && !filteredIndexes.includes( el["id"] )) {
					filteredIndexes.push( el["id"] );
				}
			});
		}

		this.filteredOut = filteredIndexes;
		this.itrPosition = this.getNextFilteredIteratorPos();

		this.refreshView();
	};
	
	this.resetFilter = function () {
		this.filteredOut = [];
		this.resetIterator();
	};

	this.isFiltered = function () {
		return this.filteredOut.length != 0;
	};

	this.prepareFilterData = function () {
		if (this.filter.terrainValues.length == 0) {
			let arr = [];
			this.data.forEach(function (el) {
				if (!arr.includes(el.terrain)) {
					arr.push(el.terrain)
				}
			});

			arr.sort();
			this.filter.terrainValues = arr;
		};
	};

	/* Update view */
	this.refreshView = function () {
		this.prepareFilterData();
		this.resetIterator();
		this.view.refreshGrid(this);
	};

	this.refreshMissionDetails = function(id) {
		if (id < 0) {
			this.view.modal_hidePopup();
			return;
		}

		let mData = this.data.find(e => e.id == id);
		this.view.modal_showPopup(mData);
	};

	/* Iterator */
	this.itrPosition = 0;

	this.getNextFilteredIteratorPos = function () {
		let nextPos = this.itrPosition + 1;
		if (nextPos >= this.size) { return -1; }

		nextPosId = this.data[nextPos]["id"];

		while ( this.filteredOut.includes( nextPosId ) ) {
			++nextPos;

			if (nextPos >= this.size) { return -1; };
			nextPosId = this.data[nextPos]["id"];
		}

		if (nextPos < this.size) {
			return nextPos;
		} else {
			return -1;
		}
	};

	this.hasNext = function () {
		let isOutOfBounds = (this.itrPosition >= this.size) || (this.itrPosition < 0);
		if (isOutOfBounds) { return false; }
		
		let isFilteredOut = this.filteredOut.includes(this.data[this.itrPosition]["id"]);
		return !isFilteredOut;
	};

	this.next = function () {
		let indx = this.itrPosition;

		if (this.isFiltered()) {
			this.itrPosition = this.getNextFilteredIteratorPos();
		} else {
			this.itrPosition++;
		}

		return this.data[indx];
	};

	this.resetIterator = function () {
		this.itrPosition = -1;
		this.itrPosition = this.getNextFilteredIteratorPos();
		return;
	};
};

var GridViewClass = function () {
	this.$grid = "#grid";
	this.$popup = "#popup";

	this.$filter_head = "#grid-filter tr th";
	this.$filter_terrain = "#grid-filter tr td[filter-type='terrain'] select";
	this.$filter_lines = ".filter-line";

	this.header_columns = ["title","player_count","terrain","overview","tags","briefing"];
	this.controller = null;

	this.refreshGrid = function(model) {
		this.clearGrid();
		this.filter_prepareFilter(model.filter.terrainValues);

		if (model.isFiltered()) {
			$(this.$filter_head).toggleClass("filter-active", true);
		} else {
			$(this.$filter_head).toggleClass("filter-active", false);
			this.filter_resetFilter();
		}

		while (model.hasNext()) {
			let info = model.next();
			let tags = this.tags_prepareTags(info.tags);

			$(this.$grid).append(`<tr class="grid-line" mission-id="${info.id}">`
				+ `<td>${info.title}</td>`
				+ `<td class="td-center">${info.player_count}</td>`
				+ `<td>${info.terrain}</td>`
				+ `<td class="td-overview">${info.overview}</td>`
				+ `<td class="td-tags">${tags}</td>`
				+ `<td class="td-center btn-see-more">⇱ Details</td>`
			+ "</tr>");
		}

		this.header_showSortedIcon(model.sortedBy.field, model.sortedBy.order);
		this.controller.initEvents();
	}

	this.clearGrid = function() {
		this.controller.removeEvents();
		$(this.$grid).find("tr[class='grid-line']").each(function () { $(this).remove(); });
	}

	this.header_showSortedIcon = function (column, isAscending) {
		let columnList = this.header_columns;

		$(`${this.$grid} th`).each(function (indx) {
			$(this).find("div").each(function () { $(this).remove(); });

			if (column == columnList[indx]) {
				$(this).append(isAscending ? "<div order='asc'>▲</div>" : "<div order='desc'>▼</div>");
			}
		});
	}

	this.filter_prepareFilter = function (valuesTerrain) {
		if ($(`${this.$filter_terrain} option`).length > 0) { return; }

		$(this.$filter_terrain).append(`<option></option>`);
		for (let i = 0; i < valuesTerrain.length; ++i) {
			$(this.$filter_terrain).append(`<option>${valuesTerrain[i]}</option>`);
		}

		$(this.$filter_lines).each(function () { $(this).css("display", "none") })
	}

	this.filter_resetFilter = function () {
		$(`.td-filter-inputs input, .td-filter-inputs select`).each(function () { $(this).val("") });
	}

	this.modal_showPopup = function (data) {
		$(`${this.$popup} h1`).text(data.title);
		$(`${this.$popup} p[class='modal-terrain']`).text("at " + data.terrain);
		$(`${this.$popup} p[class='modal-tags']`).html(this.tags_prepareTags(data.tags));
		$(`${this.$popup} img`).attr("src", data.map_shot);
		$(`${this.$popup} p[class='modal-briefing']`).html(data.briefing);
		$(this.$popup).css("display","block");
	}

	this.modal_hidePopup = function () {
		$(this.$popup).css("display","none");
	}

	this.tags_prepareTags = function (tags) {
		let tagHtml = "";

		tags.forEach(function (tag) {
			let tagData = TagsMarkdown[tag];
			if (tagData == null) {
				tagData = TagsMarkdown.default;
			}
			tagHtml = tagHtml.concat(`<span class="tag" style="background-color: ${tagData.bg}; color: ${tagData.text}">${tag}</span>`);
		});

		return tagHtml;
	}
}

var GridControllerClass = function () {
	this.model = null;
	this.headerEventsSet = false;
	this.filtersCollapsed = true;

	this.$grid_sortable = "#grid th[sortable='true']";
	this.$btn_popupClose = "#popup span[class='close'";
	this.$btn_seeMore = "#grid tr td[class*='btn-see-more']";

	this.$filter_head = "#grid-filter tr th";
	this.$filter_doFilter = "#btn-filter";
	this.$filter_resetFitler = "#btn-reset-filter";
	this.$filter_lines = ".filter-line";

	this.$filter_byTitle = "td[filter-type='title'] input";
	this.$filter_byTerrain = "td[filter-type='terrain'] select";
	this.$filter_bySlotsFrom = "td[filter-type='slots-gte'] input";
	this.$filter_bySlotsTo = "td[filter-type='slots-lte'] input";

	this.removeEvents = function () {
		$(this.$btn_seeMore).off();
	};

	this.initEvents = function () {
		this.removeEvents();

		/* Static elements: Grid header, Filter form, Modal window */
		if (!this.headerEventsSet) {
			/* Sortable header */
			$(this.$grid_sortable).on("click", this, function (event) {
				let cname = $(this).attr("column_name");
				let model = event.data.model;
				model.sortBy(cname);
			})

			/* Filters */
			$(this.$filter_head).on("click", this, function (event) {
				let controller = event.data;
				controller.filtersCollapsed = !controller.filtersCollapsed; // Toggle filter collapsed
				$(controller.$filter_lines).each(function () { $(this).css("display",  controller.filtersCollapsed ? "none" : "") })
			});

			$(this.$filter_doFilter).on("click", this, function (event) {
				let controller = event.data;
				let model = event.data.model;

				let byTitle = $(controller.$filter_byTitle).val();
				let byTerrain = $(controller.$filter_byTerrain).val();
				let bySlotsFrom = $(controller.$filter_bySlotsFrom).val();
				let bySlotsTo = $(controller.$filter_bySlotsTo).val();

				// Reset filters if empty filter used
				if (byTitle == "" && byTerrain == "" && bySlotsFrom == "" && bySlotsTo == "") {
					model.filterBy([]);
					return;
				}

				let params = [];
				if (byTitle != "") { params.push(["title", byTitle]) };
				if (byTerrain != "") { params.push(["terrain", byTerrain]) };
				if (bySlotsFrom != "") { params.push(["slotsFrom", parseInt(bySlotsFrom)]) };
				if (bySlotsTo != "") { params.push(["slotsTo", parseInt(bySlotsTo)]) };
				
				model.filterBy(params);
			})

			$(this.$filter_resetFitler).on("click", this, function (event) {
				let model = event.data.model;
				model.filterBy([]);
			})

			/* Modal window */
			$(this.$btn_popupClose).on("click", this, function (event) {
				let model = event.data.model;
				model.refreshMissionDetails(-1);
			})

			this.headerEventsSet = true;
		}

		/* Details button */
		$(this.$btn_seeMore).on("click", this, function (event) {
			let model = event.data.model;
			let missionId = parseInt( $(this).parent().attr("mission-id") );

			model.refreshMissionDetails(missionId);
		})
	};
}

$( document ).ready(function () {
	console.log("KEK Ready");

	GridApp = {};
	GridApp.model = new GridModelClass(missionsInfo);
	GridApp.view = new GridViewClass();
	GridApp.controller = new GridControllerClass();

	GridApp.model.view = GridApp.view;
	GridApp.view.controller = GridApp.controller;
	GridApp.controller.model = GridApp.model;

	/* Init */
	GridApp.model.refreshView();
})